/* ======================================================
//
//   main - すべてのページから読み込まれる JS ファイル
//   - RequireJS の設定
//   - 必須ライブラリと全画面共通の初期処理を開始する JS の読み込み
//
// ====================================================== */


/* ======================================================
// RequireJS の設定
// ------------------------------------------------------ */

require.config({
  //urlArgs: '2014011701',
  baseUrl: '/assets/js',
  shim: {
    '$': {
      exports: 'jQuery'
    },
    '_': {
      exports: '_'
    }
  },
  paths: {
    // JS ライブラリ
    'text'     : '../vendor/requirejs-text/text',
    '_'        : '../vendor/underscore/underscore',
    'jquery'   : '../vendor/jquery/dist/jquery',
    '$'        : '../vendor/jquery/dist/jquery',

    // ブロックの JS は使用頻度が多い割に階層が深いのでここでまとめて登録する。
    // アルファベット順に並べるといいかも。
    TheBlock: 'block/theBlock/TheBlock'
  }
});


/* ======================================================
// 必須ライブラリと全画面共通の初期処理を開始する JS の読み込み
// ------------------------------------------------------ */

require(['$', '_', 'necobase/necobase', 'gid/gid', 'gid/all']);
